/*=========================================================================\
* Copyright(C)2016 Chudai.
*
* File name    : child.h
* Version      : v1.0.0
* Author       : i.sshe
* Github       : github.com/isshe
* Date         : 2016/08/23
* Description  :
* Function list: 1.
*                2.
*                3.
* History      :
\*=========================================================================*/

#ifndef CHILD_H_
#define CHILD_H_

#ifdef __cplusplus
extern "C"{
#endif

/*=========================================================================*\
 * #include#                                                               *
\*=========================================================================*/
#include "main.h"
/*=========================================================================*\
 * #define#                                                                *
\*=========================================================================*/
#define MAX_EVENTS      100
#define MAX_ACCEPT      100
#define MAX_OPEN_FILE   1000
/*=========================================================================*\
 * #enum#                                                                  *
\*=========================================================================*/
enum RET_STATUS
{
    RET_FAILURE = -1,
    RET_SUCCESS = 0
};

/*=========================================================================*\
 * #struct#                                                                *
\*=========================================================================*/
typedef struct CHILD_ARG_S
{
    int listenfd;
    int childnum;
}child_arg_s, *pchild_arg_s;
/*=========================================================================*\
 * #function#                                                              *
\*=========================================================================*/


/*=====================================================================\
* Function   (名称): create_process()
* Description(功能): 创建子进程
* Called By  (被调): 1.
* Call_B file(被文): 1.
* Calls list (调用): 1.
* Calls file (调文): 1.
* Input      (输入): 1.
* Output     (输出): 1.
* Return     (返回):
*         success  :
*         failure  :
* Change log (修改): 1.
* Others     (其他): 1.
\*=====================================================================*/
int create_process(pid_t *pid, int (*proc)(void *arg), void *arg);


/*=====================================================================\
* Function   (名称): child_process
* Description(功能): 子进程处理函数（主要）
* Called By  (被调): 1.
* Call_B file(被文): 1.
* Calls list (调用): 1.
* Calls file (调文): 1.
* Input      (输入): 1.
* Output     (输出): 1.
* Return     (返回):
*         success  :
*         failure  :
* Change log (修改): 1.
* Others     (其他): 1.
\*=====================================================================*/
int child_process(void *arg);


/*=====================================================================\
* Function   (名称): do_use_fd()
* Description(功能): 使用fd，主要是进行一些读写。
* Called By  (被调): 1.
* Call_B file(被文): 1.
* Calls list (调用): 1.
* Calls file (调文): 1.
* Input      (输入): 1.
* Output     (输出): 1.
* Return     (返回):
*         success  :
*         failure  :
* Change log (修改): 1.
* Others     (其他): 1.
\*=====================================================================*/
void do_use_fd(int fd);

#ifdef __cplusplus
}
#endif

#endif

