/*=========================================================================\
* Copyright(C)2016 Chudai.
*
* File name    : deal_request.h
* Version      : v1.0.0
* Author       : i.sshe
* Github       : github.com/isshe
* Date         : 2016/08/15
* Description  :
* Function list: 1.
*                2.
*                3.
* History      :
\*=========================================================================*/

#ifndef DEAL_REQUEST_H_
#define DEAL_REQUEST_H_

#ifdef __cplusplus
extern "C"{
#endif

/*=========================================================================*\
 * #include#                                                               *
\*=========================================================================*/

/*=========================================================================*\
 * #define#                                                                *
\*=========================================================================*/

/*=========================================================================*\
 * #enum#                                                                  *
\*=========================================================================*/

/*=========================================================================*\
 * #struct#                                                                *
\*=========================================================================*/

/*=========================================================================*\
 * #function#                                                              *
\*=========================================================================*/


/*=====================================================================\
* Function   (名称): accept_request()
* Description(功能): 接受请求
* Called By  (被调): 1.
* Call_B file(被文): 1.
* Calls list (调用): 1.
* Calls file (调文): 1.
* Input      (输入): 1. 套接字
* Output     (输出): 1.
* Return     (返回):
*         success  :
*         failure  :
* Change log (修改): 1.
* Others     (其他): 1.
\*=====================================================================*/
void *accept_request(void *fd);

int get_line(int sockfd, char *buf, int bufsize);


void execute_cgi(int clientfd, const char *path,
        const char *method, const char *query_string);

static void send_file(int clientfd, FILE *resource);

void serve_file(int clientfd, const char *filename);


#ifdef __cplusplus
}
#endif

#endif

